# Pandas
- 구조화된 데이터를 처리하는 파이썬 라이브러리.

## data loading

In [1]:
import pandas as pd

In [2]:
data_url='https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data' #open URL
df_data=pd.read_csv(data_url, sep='\s+', header=None)
df_data.head() #처음 다섯줄 출력

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [3]:
#column 이름 지정
df_data.columns=['CRIM','ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD', 'TAX', 'PTRATIO' ,'B', 'LSTAT', 'MEDV']
df_data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [4]:
df_data.values #값을 뽑아줌. 데이터 형태는 numpy

array([[6.3200e-03, 1.8000e+01, 2.3100e+00, ..., 3.9690e+02, 4.9800e+00,
        2.4000e+01],
       [2.7310e-02, 0.0000e+00, 7.0700e+00, ..., 3.9690e+02, 9.1400e+00,
        2.1600e+01],
       [2.7290e-02, 0.0000e+00, 7.0700e+00, ..., 3.9283e+02, 4.0300e+00,
        3.4700e+01],
       ...,
       [6.0760e-02, 0.0000e+00, 1.1930e+01, ..., 3.9690e+02, 5.6400e+00,
        2.3900e+01],
       [1.0959e-01, 0.0000e+00, 1.1930e+01, ..., 3.9345e+02, 6.4800e+00,
        2.2000e+01],
       [4.7410e-02, 0.0000e+00, 1.1930e+01, ..., 3.9690e+02, 7.8800e+00,
        1.1900e+01]])

In [5]:
type(df_data.values)

numpy.ndarray

## Series
- column vector를 표현하는 object
- 인덱스별로 value값을 하나씩 가지는 구조.

In [6]:
from pandas import Series, DataFrame

In [7]:
list_data=[1,2,3,4,5]
example_obj=Series(data=list_data)  #data는 list 또는 dict값 가능.
example_obj #인덱스값과 value가 생성된다.

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
list_name=['a','b','c','d','e']
example_obj=Series(data=list_data, index=list_name) # index인자 : index 이름을 지정
example_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [9]:
example_obj['a']

1

In [10]:
example_obj['a']=2.2
example_obj

a    2
b    2
c    3
d    4
e    5
dtype: int64

## DataFrame
- index와 column으로 이루어져있고 접근할 수 있음.

In [11]:
#dataframe 생성
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
        'age': [42, 52, 36, 24, 73],
        'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city'])
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [13]:
DataFrame(raw_data, columns=['age','city'])

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   73         Boston

In [14]:
DataFrame(raw_data, columns=['age', 'city', 'new']) #새로운 열 생성. nan으로 들어감

   age           city  new
0   42  San Francisco  NaN
1   52      Baltimore  NaN
2   36          Miami  NaN
3   24        Douglas  NaN
4   73         Boston  NaN

In [15]:
df['first_name'] #column 선택 - series 추출

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [16]:
df.first_name

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [17]:
df.loc[1]   #loc : index location  #index의 이름!!!!으로 value를 가져움

first_name        Molly
last_name      Jacobson
age                  52
city          Baltimore
Name: 1, dtype: object

In [18]:
df['age'].iloc[1:] # iloc : index position. 인덱스의 이름이 아닌 위치로! 가져옴

1    52
2    36
3    24
4    73
Name: age, dtype: int64

In [19]:
import numpy as np
s = pd.Series(np.nan, index=[49,48,47,46,45, 1, 2, 3, 4, 5])
s

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
dtype: float64

In [20]:
s.loc[3:]    ## loc : index의 이름기준!!!

3   NaN
4   NaN
5   NaN
dtype: float64

In [21]:
s.iloc[3:]  ## iloc : index의 위치기준!!

46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
dtype: float64

In [24]:
# 새 column 생성
df['debt']=df.age>40
df

  first_name last_name  age           city   debt
0      Jason    Miller   42  San Francisco   True
1      Molly  Jacobson   52      Baltimore   True
2       Tina       Ali   36          Miami  False
3       Jake    Milner   24        Douglas  False
4        Amy     Cooze   73         Boston   True

In [25]:
#column 삭제
del df['debt']
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [26]:
df[['first_name', 'last_name']]

  first_name last_name
0      Jason    Miller
1      Molly  Jacobson
2       Tina       Ali
3       Jake    Milner
4        Amy     Cooze

In [27]:
df[:2] #인덱스를 이용해 특정 행만 추출

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore

In [28]:
age=df['age']
age

0    42
1    52
2    36
3    24
4    73
Name: age, dtype: int64

In [29]:
age[[0,3,1]]

0    42
3    24
1    52
Name: age, dtype: int64

In [30]:
age[age>40]

0    42
1    52
4    73
Name: age, dtype: int64

In [31]:
df.index=df['city']
df

              first_name last_name  age           city
city
San Francisco      Jason    Miller   42  San Francisco
Baltimore          Molly  Jacobson   52      Baltimore
Miami               Tina       Ali   36          Miami
Douglas             Jake    Milner   24        Douglas
Boston               Amy     Cooze   73         Boston

In [32]:
del df['city']
df

              first_name last_name  age
city
San Francisco      Jason    Miller   42
Baltimore          Molly  Jacobson   52
Miami               Tina       Ali   36
Douglas             Jake    Milner   24
Boston               Amy     Cooze   73

In [33]:
df[['first_name','last_name']][:2]

              first_name last_name
city
San Francisco      Jason    Miller
Baltimore          Molly  Jacobson

In [34]:
df.loc[['Miami','Boston'],'age']

city
Miami     36
Boston    73
Name: age, dtype: int64

In [35]:
df

              first_name last_name  age
city
San Francisco      Jason    Miller   42
Baltimore          Molly  Jacobson   52
Miami               Tina       Ali   36
Douglas             Jake    Milner   24
Boston               Amy     Cooze   73

In [36]:
df.index=list(range(0,5))
df

  first_name last_name  age
0      Jason    Miller   42
1      Molly  Jacobson   52
2       Tina       Ali   36
3       Jake    Milner   24
4        Amy     Cooze   73

In [39]:
df.drop(2)

  first_name last_name  age
0      Jason    Miller   42
1      Molly  Jacobson   52
3       Jake    Milner   24
4        Amy     Cooze   73

In [40]:
df.drop([1,3])

  first_name last_name  age
0      Jason    Miller   42
2       Tina       Ali   36
4        Amy     Cooze   73

In [41]:
df

  first_name last_name  age
0      Jason    Miller   42
1      Molly  Jacobson   52
2       Tina       Ali   36
3       Jake    Milner   24
4        Amy     Cooze   73